# ── Core ──────────────────────────────────────────────────────────────────────
brew "git"
brew "gh"             # GitHub CLI (multi-account support)
brew "zsh"
brew "fzf"
brew "ripgrep"
brew "bat"            # better cat
brew "eza"            # better ls
brew "jq"             # JSON processor
brew "zoxide"         # smarter cd
brew "tmux"           # for remote/SSH sessions
brew "git-delta"      # better diffs
brew "starship"       # prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "mackup"         # sync non-CLI app configs

# Launcher / menubar
cask "raycast"
cask "hiddenbar"

# ── Development ───────────────────────────────────────────────────────────────
brew "node"
brew "uv"             # Python (manages virtualenvs and Python versions)

# Editors / terminal
tap "manaflow-ai/cmux"
cask "cmux"
cask "zed"

# ── AI ────────────────────────────────────────────────────────────────────────
cask "claude-code@latest"
cask "codex"
cask "paseo"
