# Core CLI
brew "git"
brew "gh"             # GitHub CLI (multi-account support)
brew "zsh"
brew "fzf"
brew "ripgrep"
brew "bat"          # better cat
brew "eza"          # better ls
brew "jq"           # JSON processor
brew "zoxide"       # smarter cd
brew "tmux"         # for remote/SSH sessions

# Node
brew "node"

# Python (managed via uv, not brew)
brew "uv"

# Terminal
tap "manaflow-ai/cmux"
cask "cmux"
cask "zed"

# AI coding agents
cask "claude-code"
cask "codex"
cask "paseo"

# Launcher
cask "raycast"

# Sync non-CLI app configs
brew "mackup"
